<?
include "../../inc/common.inc"; 				// DB컨넥션, 접속자 파악
include "../../inc/util.inc"; 					// 유틸 라이브러리
include "../../inc/oper_info.inc"; 		// 운영 정보

if(!strcmp($oper_info->pay_test, "Y")) {//테스트
	$oper_info->pay_id = "T0007";
	$oper_info->pay_key = "3CRB7XHFjUp6fjf1FLEM.g6__";
}
    /* ============================================================================== */
    /* =   PAGE : 공통 통보 PAGE                                                    = */
    /* = -------------------------------------------------------------------------- = */
    /* =   Copyright (c)  2006   KCP Inc.   All Rights Reserverd.                   = */
    /* ============================================================================== */
?>
<?
    /* ============================================================================== */
    /* =   01. 공통 통보 페이지 설명(필독!!)                                        = */
    /* = -------------------------------------------------------------------------- = */
    /* =   에스크로 서비스의 경우, 가상계좌 입금 통보 데이터와 가상계좌 환불        = */
    /* =   통보 데이터, 구매확인/구매취소 통보 데이터, 배송시작 통보 데이터 등을    = */
    /* =   KCP 를 통해 별도로 통보 받을 수 있습니다. 이러한 통보 데이터를 받기      = */
    /* =   위해 가맹점측은 결과를 전송받는 페이지를 마련해 놓아야 합니다.           = */
    /* =   현재의 페이지를 업체에 맞게 수정하신 후, KCP 관리자 페이지에 등록해      = */
    /* =   주시기 바랍니다. 등록 방법은 연동 매뉴얼을 참고하시기 바랍니다.          = */
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   02. 공통 통보 데이터 받기                                                = */
    /* = -------------------------------------------------------------------------- = */
    $site_cd      = $_POST [ "site_cd"  ];                 // 사이트 코드
    $tno          = $_POST [ "tno"      ];                 // KCP 거래번호
    $order_no     = $_POST [ "order_no" ];                 // 주문번호
    $tx_cd        = $_POST [ "tx_cd"    ];                 // 업무처리 구분 코드
    $tx_tm        = $_POST [ "tx_tm"    ];                 // 업무처리 완료 시간
    /* = -------------------------------------------------------------------------- = */
    $ipgm_name    = "";                                    // 주문자명
    $remitter     = "";                                    // 입금자명
    $ipgm_mnyx    = "";                                    // 입금 금액
    $bank_code    = "";                                    // 은행코드
    $account      = "";                                    // 가상계좌 입금계좌번호
    $op_cd        = "";                                    // 처리구분 코드
    $noti_id      = "";                                    // 통보 아이디
    /* = -------------------------------------------------------------------------- = */
    $refund_nm    = "";                                    // 환불계좌주명
    $refund_mny   = "";                                    // 환불금액
    $bank_code    = "";                                    // 은행코드
    /* = -------------------------------------------------------------------------- = */
    $st_cd        = "";                                    // 구매확인 코드
    $can_msg      = "";                                    // 구매취소 사유
    /* = -------------------------------------------------------------------------- = */
    $waybill_no   = "";                                    // 운송장 번호
    $waybill_corp = "";                                    // 택배 업체명

    /* = -------------------------------------------------------------------------- = */
    /* =   02-1. 가상계좌 입금 통보 데이터 받기                                     = */
    /* = -------------------------------------------------------------------------- = */
    if ( $tx_cd == "TX00" )
    {
        $ipgm_name = $_POST[ "ipgm_name" ];                // 주문자명
        $remitter  = $_POST[ "remitter"  ];                // 입금자명
        $ipgm_mnyx = $_POST[ "ipgm_mnyx" ];                // 입금 금액
        $bank_code = $_POST[ "bank_code" ];                // 은행코드
        $account   = $_POST[ "account"   ];                // 가상계좌 입금계좌번호
        $op_cd     = $_POST[ "op_cd"     ];                // 처리구분 코드
        $noti_id   = $_POST[ "noti_id"   ];                // 통보 아이디
        $cash_a_no = $_POST[ "cash_a_no" ];                // 현금영수증 승인번호
	}

    /* = -------------------------------------------------------------------------- = */
    /* =   02-2. 가상계좌 환불 통보 데이터 받기                                     = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX01" )
    {
        $refund_nm  = $_POST[ "refund_nm"  ];              // 환불계좌주명
        $refund_mny = $_POST[ "refund_mny" ];              // 환불금액
        $bank_code  = $_POST[ "bank_code"  ];              // 은행코드
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-3. 구매확인/구매취소 통보 데이터 받기                                 = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX02" )
    {
        $st_cd = $_POST[ "st_cd" ];                        // 구매확인 코드

        if ( $st_cd == "N" )                               // 구매확인 상태가 구매취소인 경우
        {
            $can_msg = $_POST[ "can_msg" ];                // 구매취소 사유
        }
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-4. 배송시작 통보 데이터 받기                                          = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX03" )
    {
        $waybill_no   = $_POST[ "waybill_no"   ];          // 운송장 번호
        $waybill_corp = $_POST[ "waybill_corp" ];          // 택배 업체명
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-5. 모바일안심결제 통보 데이터 받기                                    = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX08" )
    {
        $ipgm_mnyx = $_POST[ "ipgm_mnyx" ];                // 입금 금액
        $bank_code = $_POST[ "bank_code" ];                // 은행코드
    }
    /* ============================================================================== */

		// 주문정보
		$sql = "SELECT * FROM wiz_order WHERE orderid = '$order_no'";
		$result = mysqli_query($connect, $sql) or die(mysqli_error($connect));
		$order_info = mysqli_fetch_object($result);

    /* ============================================================================== */
    /* =   03. 공통 통보 결과를 업체 자체적으로 DB 처리 작업하시는 부분입니다.      = */
    /* = -------------------------------------------------------------------------- = */
    /* =   통보 결과를 DB 작업 하는 과정에서 정상적으로 통보된 건에 대해 DB 작업을  = */
    /* =   실패하여 DB update 가 완료되지 않은 경우, 결과를 재통보 받을 수 있는     = */
    /* =   프로세스가 구성되어 있습니다. 소스에서 result 라는 Form 값을 생성 하신   = */
    /* =   후, DB 작업이 성공 한 경우, result 의 값을 "0000" 로 세팅해 주시고,      = */
    /* =   DB 작업이 실패 한 경우, result 의 값을 "0000" 이외의 값으로 세팅해 주시  = */
    /* =   기 바랍니다. result 값이 "0000" 이 아닌 경우에는 재통보를 받게 됩니다.   = */
    /* = -------------------------------------------------------------------------- = */

    // KCP에서 전송한 데이터가 맞는지 IP 체크
    $kcp_ip_list = Array("203.238.36.58", "203.238.36.161", "203.238.36.178", "203.238.36.160", "203.238.36.173");
    for($ii = 0; $ii < count($kcp_ip_list); $ii++) {
    	$kcp_ip[$kcp_ip_list[$ii]] = true;
    }

		$result = "0000";

    if(!strcmp($kcp_ip[getenv("REMOTE_ADDR")], true)) {

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-1. 가상계좌 입금 통보 데이터 DB 처리 작업 부분                        = */
	    /* = -------------------------------------------------------------------------- = */
	    if ( $tx_cd == "TX00" )
	    {
	    		////////////////////////////////////////////////////////////////////////////
				 	/////////////////////// 주문정보 업데이트 //////////////////////////////////
				 	////////////////////////////////////////////////////////////////////////////

					$_Payment['status'] = "OY"; //결제상태
					$_Payment['orderid'] = $order_no; //주문번호
					$_Payment[paymethod] = $order_info->pay_method; //결제종류
					$_Payment[ttno] = $tno; //거래번호
					$_Payment[bankkind] = $bank_code; //은행코드
					$_Payment[accountno] = $account; //계좌번호
					$_Payment[pgname] = "inicis";//PG사 종류
					$_Payment[es_check]	= $oper_info->pay_escrow;//에스크로 사용여부
					$_Payment[es_stats]	= "IN";//에스크로 상태(데이콤으로 기본정보 발송)
					$_Payment[tprice]		=	$ipgm_mnyx; //결제금액

					//결제처리(상태변경,주문 업데이트)
					Exe_payment($_Payment);
					// 적립금 처리 : 적립금 사용시 적립금 감소
					Exe_reserve();
					// 재고처리
					Exe_stock();

	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-2. 가상계좌 환불 통보 데이터 DB 처리 작업 부분                        = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX01" )
	    {
	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-3. 구매확인/구매취소 통보 데이터 DB 처리 작업 부분                    = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX02" )
	    {
        if ( $st_cd == "N" )                               // 구매확인 상태가 구매취소인 경우
        {
            $can_msg = $_POST[ "can_msg" ];                // 구매취소 사유

						$sql = "update wiz_order set status = 'RD', cancelmsg='[에스크로 구매취소 요청] $can_msg', escrow_stat = 'UX' where orderid = '$order_no'";
						$result = mysqli_query($connect, $sql);

        } else {

						$sql = "UPDATE wiz_order SET escrow_stats = 'US' where orderid = '$order_no'";
						$result = mysqli_query($connect, $sql);

        }

	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-4. 배송시작 통보 데이터 DB 처리 작업 부분                             = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX03" )
	    {
	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-5. 정산보류 통보 데이터 DB 처리 작업 부분                             = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX04" )
	    {
	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-6. 즉시취소 통보 데이터 DB 처리 작업 부분                             = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX05" )
	    {
	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-7. 취소 통보 데이터 DB 처리 작업 부분                                 = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX06" )
	    {
	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-8. 발급계좌해지 통보 데이터 DB 처리 작업 부분                         = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX07" )
	    {
	    }

	    /* = -------------------------------------------------------------------------- = */
	    /* =   03-9. 모바일안심결제 통보 데이터 DB 처리 작업 부분                       = */
	    /* = -------------------------------------------------------------------------- = */
	    else if ( $tx_cd == "TX08" )
	    {
	    }
	    /* ============================================================================== */

  	}

    /* ============================================================================== */
    /* =   04. result 값 세팅 하기                                                  = */
    /* ============================================================================== */
?>
<html><body><form><input type="hidden" name="result" value="<?=$result?>"></form></body></html>